OpenNuvoton/M55M1BSP/SampleCode/StdDriver/QSPI_QuadMode_Flash/main.c
/**************************************************************************//**
 * @file    main.c
 * @version V1.00
 * @brief   Access SPI flash using QSPI quad mode
 *
 * SPDX-License-Identifier: Apache-2.0
 * Copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/
#include <stdio.h>
#include "NuMicro.h"

/*******************************************************************************
 * PRIVATE MACROS AND DEFINES
 ******************************************************************************/
#define TEST_NUMBER                 (1)       /* page numbers */
#define TEST_LENGTH                 (256)     /* length */

// *** <<< Use Configuration Wizard in Context Menu >>> ***
// <o> GPIO Slew Rate Control
// <0=> Normal <1=> High <2=> Fast0 <3=> Fast1
#define SlewRateMode                2
// <c1> Enable QSPI Optimize
// <i> Use FIFO mechanism and enable PDMA for QSPI RX to maximize throughput.
#define ENABLE_QSPI_OPTIMIZE
// </c>
// *** <<< end of configuration section >>> ***

#define SPI_FLASH_PORT              QSPI0

#ifdef ENABLE_QSPI_OPTIMIZE
    #define QSPI_RX_PDMA_CH         0
#endif

/* SPI Flash Operation Code */
#define OPCODE_DMY                  (0x00U)   /* Dummy data */
#define OPCODE_WREN                 (0x06U)   /* Write enable */
#define OPCODE_RDSR                 (0x05U)   /* Read status register #1*/
#define OPCODE_WRSR                 (0x01U)   /* Write status register #1 */
#define OPCODE_RDSR2                (0x35U)   /* Read status register #2*/
#define OPCODE_WRSR2                (0x31U)   /* Write status register #2 */
#define OPCODE_RDSR3                (0x15U)   /* Read status register #3*/
#define OPCODE_WRSR3                (0x11U)   /* Write status register #3 */
#define OPCODE_PP                   (0x02U)   /* Page program (up to 256 bytes) */
#define OPCODE_SE_4K                (0x20U)   /* Erase 4KB sector */
#define OPCODE_BE_32K               (0x52U)   /* Erase 32KB block */
#define OPCODE_CHIP_ERASE           (0xC7U)   /* Erase whole flash chip */
#define OPCODE_BE_64K               (0xD8U)   /* Erase 64KB block */
#define OPCODE_READ_ID              (0x90U)   /* Read ID */
#define OPCODE_RDID                 (0x9fU)   /* Read JEDEC ID */

#define OPCODE_NORM_READ            (0x03U)   /* Read data bytes */
#define OPCODE_FAST_READ            (0x0BU)   /* Read data bytes */
#define OPCODE_FAST_DUAL_READ       (0x3BU)   /* Read data bytes */
#define OPCODE_FAST_QUAD_READ       (0x6BU)   /* Read data bytes */
#define OPCODE_FAST_QUAD_IO_READ    (0xEBU)  /* Read data bytes */

#define FLH_IS_BUSY                 (0x01)

#define FLH_W25Q80                  (0xEF13)
#define FLH_W25Q16                  (0xEF14)
#define FLH_W25Q32                  (0xEF15)
#define FLH_W25Q64                  (0xEF16)
#define FLH_W25Q128                 (0xEF17)
#define FLH_W25Q256                 (0xEF18)

/*******************************************************************************
 * GLOBAL VARIABLES
 ******************************************************************************/
#if (NVT_DCACHE_ON == 1)
/* DCache-line aligned buffer for SPI0 data transfer with PDMA */
uint8_t g_au8SrcArray[DCACHE_ALIGN_LINE_SIZE(TEST_LENGTH)] __attribute__((aligned(DCACHE_LINE_SIZE))) = {0};
uint8_t g_au8DestArray[DCACHE_ALIGN_LINE_SIZE(TEST_LENGTH)] __attribute__((aligned(DCACHE_LINE_SIZE))) = {0};
#else
/* Buffer for SPI0 data transfer with PDMA when DCache is disabled */
static uint8_t g_au8SrcArray[TEST_LENGTH];
static uint8_t g_au8DestArray[TEST_LENGTH];
#endif

void D2D3_SwitchToNormalMode(void);
void D2D3_SwitchToQuadMode(void);
int32_t SpiFlash_ReadMidDid(uint16_t *pu16Id);
int32_t SpiFlash_ChipErase(void);
int32_t SpiFlash_ReadStatusReg(uint8_t *pu8Value);
int32_t SpiFlash_ReadStatusReg2(uint8_t *pu8Value);
int32_t SpiFlash_WriteStatusReg(uint8_t u8Value1, uint8_t u8Value2);
int32_t SpiFlash_WaitReady(void);
int32_t SpiFlash_NormalPageProgram(uint32_t u32StartAddress, uint8_t *u8DataBuffer);
int32_t spiFlash_EnableQEBit(void);
int32_t spiFlash_DisableQEBit(void);
int32_t SpiFlash_QuadFastRead(uint32_t u32StartAddress, uint8_t *u8DataBuffer);
void SYS_Init(void);

//------------------------------------------------------------------------------
#ifdef ENABLE_QSPI_OPTIMIZE
static void QSPI_PDMA_Rx_Init(QSPI_T *module, uint32_t *u32RxTargetAddr, uint32_t u32TransferCount)
{
    /* Reset PDMA module */
    SYS_ResetModule(SYS_PDMA0RST);

    PDMA_Open(PDMA0, (1 << QSPI_RX_PDMA_CH));

    /* --- RX PDMA  --- */
    /* Set transfer width (32 bits) and transfer count */
    PDMA_SetTransferCnt(PDMA0, QSPI_RX_PDMA_CH, PDMA_WIDTH_32, u32TransferCount);
    //:APB to MEM (QSPI RX RAM)
    PDMA_SetTransferMode(PDMA0, QSPI_RX_PDMA_CH, PDMA_QSPI0_RX, FALSE, 0);

    /* Set source/destination address and attributes */
    PDMA_SetTransferAddr(PDMA0, QSPI_RX_PDMA_CH,
                         (uint32_t) & (module)->RX,
                         PDMA_SAR_FIX,
                         (uint32_t)u32RxTargetAddr,
                         PDMA_DAR_INC);
    /* Single request type. SPI only support PDMA single request type. */
    PDMA_SetBurstType(PDMA0, QSPI_RX_PDMA_CH, PDMA_REQ_SINGLE, 0);
    /* Disable table interrupt */
    PDMA0->DSCT[QSPI_RX_PDMA_CH].CTL |= PDMA_DSCT_CTL_TBINTDIS_Msk;
}

static void QSPI_PDMA_Rx_Polling(void)
{
    uint32_t u32RetryTimes = SystemCoreClock;

    while (1)
    {
        /* Polling status flag. */
        if (PDMA_GET_TD_STS(PDMA0) & (1 << QSPI_RX_PDMA_CH))
        {
            break;
        }

        u32RetryTimes--;

        if (u32RetryTimes == 0)
        {
            break;
        }
    }

    PDMA_CLR_TD_FLAG(PDMA0, (1 << QSPI_RX_PDMA_CH));

    /* Disable SPI master's PDMA transfer function */
    QSPI_DISABLE_RX_PDMA(QSPI0);
}
#endif

void D2D3_SwitchToNormalMode(void)
{
    SYS->GPA_MFP1 =  SYS->GPA_MFP1 & ~(SYS_GPA_MFP1_PA4MFP_Msk | SYS_GPA_MFP1_PA5MFP_Msk);
    GPIO_SetMode(PA, BIT4, GPIO_MODE_OUTPUT);
    GPIO_SetMode(PA, BIT5, GPIO_MODE_OUTPUT);
    PA4 = 1;
    PA5 = 1;
}

