OpenNuvoton/M55M1BSP/SampleCode/StdDriver/QSPI_QuadMode_Flash/main.c
void D2D3_SwitchToQuadMode(void)
{
    SET_QSPI0_MOSI1_PA4();
    SET_QSPI0_MISO1_PA5();
}

__STATIC_INLINE int32_t wait_QSPI_IS_BUSY(QSPI_T *qspi)
{
    volatile int32_t i32TimeOutCnt = SystemCoreClock; /* 1 second time-out */

    while (QSPI_IS_BUSY(qspi))
    {
        if (--i32TimeOutCnt <= 0)
        {
            printf("Wait for QSPI time-out!\n");
            return QSPI_ERR_TIMEOUT;
        }
    }

    return QSPI_OK;
}

int32_t SpiFlash_ReadMidDid(uint16_t *pu16Id)
{
    uint8_t u8RxData[6], u8IDCnt = 0;
    int32_t i32Status;

    // /CS: active
    QSPI_SET_SS_LOW(SPI_FLASH_PORT);

    // send Command: 0x90, Read Manufacturer/Device ID
    QSPI_WRITE_TX(SPI_FLASH_PORT, OPCODE_READ_ID);

    // send 24-bit '0', dummy
    QSPI_WRITE_TX(SPI_FLASH_PORT, OPCODE_DMY);
    QSPI_WRITE_TX(SPI_FLASH_PORT, OPCODE_DMY);
    QSPI_WRITE_TX(SPI_FLASH_PORT, OPCODE_DMY);

    // receive 16-bit
    QSPI_WRITE_TX(SPI_FLASH_PORT, OPCODE_DMY);
    QSPI_WRITE_TX(SPI_FLASH_PORT, OPCODE_DMY);

    // wait tx finish
    i32Status = wait_QSPI_IS_BUSY(SPI_FLASH_PORT);

    // /CS: de-active
    QSPI_SET_SS_HIGH(SPI_FLASH_PORT);

    if (i32Status != QSPI_OK)
    {
        return i32Status;
    }

    while (!QSPI_GET_RX_FIFO_EMPTY_FLAG(SPI_FLASH_PORT))
        u8RxData[u8IDCnt ++] = (uint8_t)QSPI_READ_RX(SPI_FLASH_PORT);

    *pu16Id = (uint16_t)((u8RxData[4] << 8) | u8RxData[5]);

    return QSPI_OK;
}

int32_t SpiFlash_ChipErase(void)
{
    int32_t i32Status;

    // /CS: active
    QSPI_SET_SS_LOW(SPI_FLASH_PORT);

    // send Command: 0x06, Write enable
    QSPI_WRITE_TX(SPI_FLASH_PORT, OPCODE_WREN);

    // wait tx finish
    i32Status = wait_QSPI_IS_BUSY(SPI_FLASH_PORT);

    // /CS: de-active
    QSPI_SET_SS_HIGH(SPI_FLASH_PORT);

    if (i32Status != QSPI_OK)
    {
        return i32Status;
    }

    //////////////////////////////////////////

    // /CS: active
    QSPI_SET_SS_LOW(SPI_FLASH_PORT);

    // send Command: 0xC7, Chip Erase
    QSPI_WRITE_TX(SPI_FLASH_PORT, OPCODE_CHIP_ERASE);

    // wait tx finish
    i32Status = wait_QSPI_IS_BUSY(SPI_FLASH_PORT);

    // /CS: de-active
    QSPI_SET_SS_HIGH(SPI_FLASH_PORT);

    if (i32Status != QSPI_OK)
    {
        return i32Status;
    }

    QSPI_ClearRxFIFO(SPI_FLASH_PORT);

    return QSPI_OK;
}

int32_t SpiFlash_ReadStatusReg(uint8_t *pu8Value)
{
    uint8_t u8Val;
    int32_t i32Status;

    QSPI_ClearRxFIFO(SPI_FLASH_PORT);

    // /CS: active
    QSPI_SET_SS_LOW(SPI_FLASH_PORT);

    // send Command: 0x05, Read status register
    QSPI_WRITE_TX(SPI_FLASH_PORT, OPCODE_RDSR);

    // read status
    QSPI_WRITE_TX(SPI_FLASH_PORT, OPCODE_DMY);

    // wait tx finish
    i32Status = wait_QSPI_IS_BUSY(SPI_FLASH_PORT);

    // /CS: de-active
    QSPI_SET_SS_HIGH(SPI_FLASH_PORT);

    if (i32Status != QSPI_OK)
    {
        return i32Status;
    }

    // skip first rx data
    u8Val = (uint8_t)QSPI_READ_RX(SPI_FLASH_PORT);
    u8Val = (uint8_t)QSPI_READ_RX(SPI_FLASH_PORT);

    *pu8Value = u8Val;

    return QSPI_OK;
}

int32_t SpiFlash_ReadStatusReg2(uint8_t *pu8Value)
{
    uint8_t u8Val;
    int32_t i32Status;

    QSPI_ClearRxFIFO(SPI_FLASH_PORT);

    // /CS: active
    QSPI_SET_SS_LOW(SPI_FLASH_PORT);

    // send Command: 0x35, Read status register
    QSPI_WRITE_TX(SPI_FLASH_PORT, OPCODE_RDSR2);

    // read status
    QSPI_WRITE_TX(SPI_FLASH_PORT, OPCODE_DMY);

    // wait tx finish
    i32Status = wait_QSPI_IS_BUSY(SPI_FLASH_PORT);

    // /CS: de-active
    QSPI_SET_SS_HIGH(SPI_FLASH_PORT);

    if (i32Status != QSPI_OK)
    {
        return i32Status;
    }

    // skip first rx data
    u8Val = (uint8_t)QSPI_READ_RX(SPI_FLASH_PORT);
    u8Val = (uint8_t)QSPI_READ_RX(SPI_FLASH_PORT);

    *pu8Value = u8Val;

    return QSPI_OK;
}

int32_t SpiFlash_WriteStatusReg(uint8_t u8Value1, uint8_t u8Value2)
{
    int32_t i32Status;

    // /CS: active
    QSPI_SET_SS_LOW(SPI_FLASH_PORT);

    // send Command: 0x06, Write enable
    QSPI_WRITE_TX(SPI_FLASH_PORT, OPCODE_WREN);

    // wait tx finish
    i32Status = wait_QSPI_IS_BUSY(SPI_FLASH_PORT);

    // /CS: de-active
    QSPI_SET_SS_HIGH(SPI_FLASH_PORT);

    if (i32Status != QSPI_OK)
    {
        return i32Status;
    }

    ///////////////////////////////////////

    // /CS: active
    QSPI_SET_SS_LOW(SPI_FLASH_PORT);

    // send Command: 0x01, Write status register
    QSPI_WRITE_TX(SPI_FLASH_PORT, OPCODE_WRSR);

    // write status
    QSPI_WRITE_TX(SPI_FLASH_PORT, u8Value1);
    QSPI_WRITE_TX(SPI_FLASH_PORT, u8Value2);

    // wait tx finish
    i32Status = wait_QSPI_IS_BUSY(SPI_FLASH_PORT);

    // /CS: de-active
    QSPI_SET_SS_HIGH(SPI_FLASH_PORT);

    return i32Status;
}

int32_t SpiFlash_WaitReady(void)
{
    uint8_t u8ReturnValue;
    int32_t i32Status;
    volatile int32_t i32TimeOutCnt = SystemCoreClock; /* 1 second time-out */

    do
    {
        if (--i32TimeOutCnt <= 0)
        {
            printf("Wait for QSPI time-out!\n");
            return QSPI_ERR_TIMEOUT;
        }

        i32Status = SpiFlash_ReadStatusReg(&u8ReturnValue);

        if (i32Status != QSPI_OK)
        {
            return i32Status;
        }
    } while ((u8ReturnValue & FLH_IS_BUSY) != 0); // check the BUSY bit

    return QSPI_OK;
}

int32_t SpiFlash_NormalPageProgram(uint32_t u32StartAddress, uint8_t *u8DataBuffer)
{
    uint32_t u32Cnt = 0;
    int32_t i32Status;

    // /CS: active
    QSPI_SET_SS_LOW(SPI_FLASH_PORT);

    // send Command: 0x06, Write enable
    QSPI_WRITE_TX(SPI_FLASH_PORT, OPCODE_WREN);

    // wait tx finish
    i32Status = wait_QSPI_IS_BUSY(SPI_FLASH_PORT);

    // /CS: de-active
    QSPI_SET_SS_HIGH(SPI_FLASH_PORT);

    if (i32Status != QSPI_OK)
    {
        return i32Status;
    }


    // /CS: active
    QSPI_SET_SS_LOW(SPI_FLASH_PORT);

    // send Command: 0x02, Page program
    QSPI_WRITE_TX(SPI_FLASH_PORT, OPCODE_PP);

    // send 24-bit start address
    QSPI_WRITE_TX(SPI_FLASH_PORT, (u32StartAddress >> 16) & 0xFF);
    QSPI_WRITE_TX(SPI_FLASH_PORT, (u32StartAddress >> 8) & 0xFF);
    QSPI_WRITE_TX(SPI_FLASH_PORT, u32StartAddress & 0xFF);

