OpenNuvoton/M55M1BSP/SampleCode/StdDriver/QSPI_QuadMode_Flash/main.c
    // write data
    while (1)
    {
        if (!QSPI_GET_TX_FIFO_FULL_FLAG(SPI_FLASH_PORT))
        {
            QSPI_WRITE_TX(SPI_FLASH_PORT, u8DataBuffer[u32Cnt++]);

            if (u32Cnt > 255) break;
        }
    }

    // wait tx finish
    i32Status = wait_QSPI_IS_BUSY(SPI_FLASH_PORT);

    // /CS: de-active
    QSPI_SET_SS_HIGH(SPI_FLASH_PORT);

    if (i32Status != QSPI_OK)
    {
        return i32Status;
    }

    QSPI_ClearRxFIFO(SPI_FLASH_PORT);

    return QSPI_OK;
}

int32_t spiFlash_EnableQEBit(void)
{
    uint8_t u8Status1;
    uint8_t u8Status2;
    int32_t i32Status;

    i32Status = SpiFlash_ReadStatusReg(&u8Status1);

    if (i32Status != QSPI_OK)
    {
        return i32Status;
    }

    i32Status = SpiFlash_ReadStatusReg2(&u8Status2);

    if (i32Status != QSPI_OK)
    {
        return i32Status;
    }

    u8Status2 |= 0x2;
    i32Status = SpiFlash_WriteStatusReg(u8Status1, u8Status2);

    if (i32Status != QSPI_OK)
    {
        return i32Status;
    }

    return SpiFlash_WaitReady();
}

int32_t spiFlash_DisableQEBit(void)
{
    uint8_t u8Status1;
    uint8_t u8Status2;
    int32_t i32Status;

    i32Status = SpiFlash_ReadStatusReg(&u8Status1);

    if (i32Status != QSPI_OK)
    {
        return i32Status;
    }

    i32Status = SpiFlash_ReadStatusReg2(&u8Status2);

    if (i32Status != QSPI_OK)
    {
        return i32Status;
    }

    u8Status2 &= ~0x2;
    i32Status = SpiFlash_WriteStatusReg(u8Status1, u8Status2);

    if (i32Status != QSPI_OK)
    {
        return i32Status;
    }

    return SpiFlash_WaitReady();
}

int32_t SpiFlash_QuadFastRead(uint32_t u32StartAddress, uint8_t *u8DataBuffer)
{
#ifndef ENABLE_QSPI_OPTIMIZE
    uint32_t u32Cnt;
#else
    uint8_t u8TXS;
    uint32_t u32TxDataCount = 0;

#if (NVT_DCACHE_ON == 1)
    /* If DCACHE is enabled, clean the data cache for the destination buffer before writing to it */
    /* This is to ensure that the data written to the cache is actually written to the memory */
    SCB_InvalidateDCache_by_Addr(u8DataBuffer, 64);
#endif

    /* Set transfer width (32 bits) and transfer count */
    PDMA_SetTransferCnt(PDMA0, QSPI_RX_PDMA_CH, PDMA_WIDTH_32, 64);
    /* Set source/destination address and attributes */
    PDMA_SetTransferAddr(PDMA0, QSPI_RX_PDMA_CH,
                         (uint32_t) & ((QSPI_T *)SPI_FLASH_PORT)->RX,
                         PDMA_SAR_FIX,
                         (uint32_t)u8DataBuffer,
                         PDMA_DAR_INC);
#endif
    int32_t i32Status;

    // enable quad mode
    i32Status = spiFlash_EnableQEBit();

    if (i32Status != QSPI_OK)
    {
        return i32Status;
    }

    // /CS: active
    QSPI_SET_SS_LOW(SPI_FLASH_PORT);

    // Command: 0xEB, Fast Read quad data
    QSPI_WRITE_TX(SPI_FLASH_PORT, OPCODE_FAST_QUAD_IO_READ);
    i32Status = wait_QSPI_IS_BUSY(SPI_FLASH_PORT);

    if (i32Status != QSPI_OK)
    {
        QSPI_SET_SS_HIGH(SPI_FLASH_PORT);
        return i32Status;
    }

    // enable SPI quad IO mode and set direction to input
    D2D3_SwitchToQuadMode();
    QSPI_ENABLE_QUAD_OUTPUT_MODE(SPI_FLASH_PORT);

    // send 24-bit start address
    QSPI_WRITE_TX(SPI_FLASH_PORT, (u32StartAddress >> 16) & 0xFF);
    QSPI_WRITE_TX(SPI_FLASH_PORT, (u32StartAddress >> 8) & 0xFF);
    QSPI_WRITE_TX(SPI_FLASH_PORT, u32StartAddress & 0xFF);

    // dummy byte
    QSPI_WRITE_TX(SPI_FLASH_PORT, OPCODE_DMY);
    QSPI_WRITE_TX(SPI_FLASH_PORT, OPCODE_DMY);
    QSPI_WRITE_TX(SPI_FLASH_PORT, OPCODE_DMY);

    i32Status = wait_QSPI_IS_BUSY(SPI_FLASH_PORT);

    if (i32Status != QSPI_OK)
    {
        QSPI_SET_SS_HIGH(SPI_FLASH_PORT);
        QSPI_DISABLE_QUAD_MODE(SPI_FLASH_PORT);
        D2D3_SwitchToNormalMode();
        return i32Status;
    }

    QSPI_ENABLE_QUAD_INPUT_MODE(SPI_FLASH_PORT);

    // clear RX buffer
    QSPI_ClearRxFIFO(SPI_FLASH_PORT);

#ifdef ENABLE_QSPI_OPTIMIZE
    QSPI_ENABLE_BYTE_REORDER(SPI_FLASH_PORT);
    QSPI_SET_DATA_WIDTH(SPI_FLASH_PORT, 32);

    /* Enable SPI master PDMA function */
    QSPI_TRIGGER_RX_PDMA(QSPI0);

    while (u32TxDataCount < 64)
    {
        /* Check TX FIFO count. The Maximum FIFO is 8 layers. */
        u8TXS = (8 - QSPI_GET_TX_FIFO_COUNT(SPI_FLASH_PORT));
        u32TxDataCount += u8TXS;

        while (u8TXS--)
        {
            QSPI_WRITE_TX(SPI_FLASH_PORT, 0xFFFFFFFF);
        }
    }

    QSPI_PDMA_Rx_Polling();
#else

    // read data
    for (u32Cnt = 0; u32Cnt < 256; u32Cnt++)
    {
        QSPI_WRITE_TX(SPI_FLASH_PORT, 0x00);
        i32Status = wait_QSPI_IS_BUSY(SPI_FLASH_PORT);

        if (i32Status != QSPI_OK)
        {
            QSPI_SET_SS_HIGH(SPI_FLASH_PORT);
            QSPI_DISABLE_QUAD_MODE(SPI_FLASH_PORT);
            D2D3_SwitchToNormalMode();
            return i32Status;
        }

        u8DataBuffer[u32Cnt] = (uint8_t)QSPI_READ_RX(SPI_FLASH_PORT);
    }

#endif

    // wait tx finish
    i32Status = wait_QSPI_IS_BUSY(SPI_FLASH_PORT);

    if (i32Status != QSPI_OK)
    {
        QSPI_SET_SS_HIGH(SPI_FLASH_PORT);
        QSPI_DISABLE_QUAD_MODE(SPI_FLASH_PORT);
        D2D3_SwitchToNormalMode();
        return i32Status;
    }

    // /CS: de-active
    QSPI_SET_SS_HIGH(SPI_FLASH_PORT);

#ifdef ENABLE_QSPI_OPTIMIZE
    QSPI_DISABLE_BYTE_REORDER(SPI_FLASH_PORT);
    QSPI_SET_DATA_WIDTH(SPI_FLASH_PORT, 8);
#endif

    QSPI_DISABLE_QUAD_MODE(SPI_FLASH_PORT);
    D2D3_SwitchToNormalMode();

    // disable quad mode
    return spiFlash_DisableQEBit();
}

void SYS_Init(void)
{
    /* Enable Internal RC 12MHz clock */
    CLK_EnableXtalRC(CLK_SRCCTL_HIRCEN_Msk);

    /* Waiting for Internal RC clock ready */
    CLK_WaitClockReady(CLK_STATUS_HIRCSTB_Msk);

    /* Enable PLL0 clock */
    CLK_EnableAPLL(CLK_APLLCTL_APLLSRC_HIRC, FREQ_220MHZ, CLK_APLL0_SELECT);

    /* Switch SCLK clock source to PLL0 and divide 1 */
    CLK_SetSCLK(CLK_SCLKSEL_SCLKSEL_APLL0);

    /* Set HCLK2 divide 2 */
    CLK_SET_HCLK2DIV(2);

    /* Set PCLKx divide 2 */
    CLK_SET_PCLK0DIV(2);
    CLK_SET_PCLK1DIV(2);
    CLK_SET_PCLK2DIV(2);
    CLK_SET_PCLK3DIV(2);
    CLK_SET_PCLK4DIV(2);

    /* Update System Core Clock */
    /* User can use SystemCoreClockUpdate() to calculate SystemCoreClock and cyclesPerUs automatically. */
    SystemCoreClockUpdate();

    /* Select PCLK0 as the clock source of QSPI0 */
    CLK_SetModuleClock(QSPI0_MODULE, CLK_QSPISEL_QSPI0SEL_PCLK0, MODULE_NoMsk);

    /* Enable QSPI0 peripheral clock */
    CLK_EnableModuleClock(QSPI0_MODULE);

#ifdef ENABLE_QSPI_OPTIMIZE
    /* Enable PDMA0 module clock */
    CLK_EnableModuleClock(PDMA0_MODULE);
#endif

    /* Enable GPIO Module clock */
    CLK_EnableModuleClock(GPIOA_MODULE);

    /* Enable UART module clock */
    SetDebugUartCLK();

    /*---------------------------------------------------------------------------------------------------------*/
    /* Init I/O Multi-function                                                                                 */
    /*---------------------------------------------------------------------------------------------------------*/
    SetDebugUartMFP();

    /* Setup QSPI0 multi-function pins */
    SET_QSPI0_SS_PA3();
    SET_QSPI0_CLK_PA2();
    SET_QSPI0_MOSI0_PA0();
    SET_QSPI0_MISO0_PA1();
    SET_QSPI0_MOSI1_PA4();
    SET_QSPI0_MISO1_PA5();

    /* Enable QSPI0 clock pin (PA2) schmitt trigger */
    PA->SMTEN |= GPIO_SMTEN_SMTEN2_Msk;

